exshonda/asp3_core/arch/arm_m_gcc/imxrt600/IMXRT600.h
/*
 *  TOPPERS Software
 *      Toyohashi Open Platform for Embedded Real-Time Systems
 *
 *  Copyright (C) 2007,2011,2015 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *
 *  上記著作権者は，以下の(1)～(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 *
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 *
 */

#ifndef TOPPERS_IMXRT600_H
#define TOPPERS_IMXRT600_H

#ifdef TOPPERS_ENABLE_TRUSTZONE
#define IMXRT600_APB_BASE 0x50000000
#else
#define IMXRT600_APB_BASE 0x40000000
#endif

#define IMXRT600_SYSCON_CLKCTL0_BASE (IMXRT600_APB_BASE + 0x01000)
#define IMXRT600_SYSCON_CLKCTL1_BASE (IMXRT600_APB_BASE + 0x21000)
#define IMXRT600_SYSCON_RSTCTL1_BASE (IMXRT600_APB_BASE + 0x20000)
#define IMXRT600_SYSCON_SYSCTL0_BASE (IMXRT600_APB_BASE + 0x02000)
#define IMXRT600_SYSCON_SYSCTL1_BASE (IMXRT600_APB_BASE + 0x22000)
#define IMXRT600_SYSCON_CLKCTL0_SYSOSCCTL0          ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x160))
#define IMXRT600_SYSCON_CLKCTL0_SYSOSCBYPASS        ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x168))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLLCLKSEL        ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x200))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0CTL0         ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x204))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0LOCKTIMEDIV2 ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x20C))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0NUM          ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x210))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0DENOM        ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x214))
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD          ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x218))
#define IMXRT600_SYSCON_CLKCTL0_MAINPLLCLKDIV       ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x240))
#define IMXRT600_SYSCON_CLKCTL0_AUX0PLLCLKDIV       ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x248))
#define IMXRT600_SYSCON_CLKCTL0_SYSCPUAHBCLKDIV     ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x400))
#define IMXRT600_SYSCON_CLKCTL0_MAINCLKSELB         ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x434))
#define IMXRT600_SYSCON_CLKCTL0_FLEXSPIFCLKSEL      ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x620))
#define IMXRT600_SYSCON_CLKCTL0_FLEXSPIFCLKDIV      ((uint32_t *)(IMXRT600_SYSCON_CLKCTL0_BASE + 0x624))
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL0_SET         ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x40))
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL2_SET         ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x48))
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL0_CLR         ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x70))
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKSEL(n)       ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x500 + 0x20 * (n)))
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKCTL(n)       ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x504 + 0x20 * (n)))
#define IMXRT600_SYSCON_CLKCTL1_FCnFCLKSEL(n)       ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x508 + 0x20 * (n)))
#define IMXRT600_SYSCON_CLKCTL1_FRGPLLCLKDIV        ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x6FC))
#define IMXRT600_SYSCON_CLKCTL1_CT32BITnFCLKSEL(n)  ((uint32_t *)(IMXRT600_SYSCON_CLKCTL1_BASE + 0x720 + 4 * (n)))
#define IMXRT600_SYSCON_RSTCTL1_PRSTCTL0_CLR        ((uint32_t *)(IMXRT600_SYSCON_RSTCTL1_BASE + 0x70))
#define IMXRT600_SYSCON_RSTCTL1_PRSTCTL2_CLR        ((uint32_t *)(IMXRT600_SYSCON_RSTCTL1_BASE + 0x78))
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG0         ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x600))
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG1         ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x604))
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG2         ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x608))
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG3         ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x60C))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0           ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x610))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG1           ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x614))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG2           ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x618))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG3           ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x61C))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0_SET       ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x620))
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0_CLR       ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x630))
#define IMXRT600_SYSCON_SYSCTL0_PDWAKECFG           ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x660))
#define IMXRT600_SYSCON_SYSCTL0_STARTEN1_SET        ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x6A4))
#define IMXRT600_SYSCON_SYSCTL0_STARTEN1_CLR        ((uint32_t *)(IMXRT600_SYSCON_SYSCTL0_BASE + 0x6C4))

#define IMXRT600_SYSCON_CLKCTL0_SYSOSCCTL0_LP_ENABLE           (1 << 0)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLLCLKSEL_SEL_CLK_IN        (1 << 0)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA    (1 << 13)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0CTL0_MULT(n)            ((n) << 16)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD0(n)             ((n) << 0)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD0_CLKRDY         (1 << 6)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD0_CLKGATE        (1 << 7)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD2(n)             ((n) << 16)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD2_CLKRDY         (1 << 22)
#define IMXRT600_SYSCON_CLKCTL0_SYSPLL0PFD_PFD2_CLKGATE        (1 << 23)
#define IMXRT600_SYSCON_CLKCTL0_MAINCLKSELB_SEL_MAIN_PLL_CLK   (2)
#define IMXRT600_SYSCON_CLKCTL0_FLEXSPIFCLKSEL_SEL_MAIN_CLK    (1)
#define IMXRT600_SYSCON_CLKCTL0_FLEXSPIFCLKSEL_SEL_AUX0_CLK    (2)
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL0_FCn_CLK(n)             (1 << ((n) + 8))
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL0_OSEVENT_TIMER_CLK      (1 << 27)
#define IMXRT600_SYSCON_CLKCTL1_PSCCTL2_CT32BITn_CLK(n)        (1 << (n))
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKSEL_SEL_MAIN_CLOCK      (0)
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKSEL_SEL_FRG_PLL_CLOCK   (1)
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKSEL_SEL_NONE            (7)
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKCTL_DIV(n)              ((n) << 0)
#define IMXRT600_SYSCON_CLKCTL1_FRGnCLKCTL_MULT(n)             ((n) << 8)
#define IMXRT600_SYSCON_CLKCTL1_FCnFCLKSEL_SEL_FCn_FRG_CLOCK   (4)
#define IMXRT600_SYSCON_CLKCTL1_FCnFCLKSEL_SEL_NONE            (7)
#define IMXRT600_SYSCON_CLKCTL1_CT32BITnFCLKSEL_SEL_MAIN_CLOCK (0)
#define IMXRT600_SYSCON_RSTCTL1_PRSTCTL0_FLEXCOMMn_RST(n)      (1 << ((n) + 8))
#define IMXRT600_SYSCON_RSTCTL1_PRSTCTL2_CT32BITn_RST(n)       (1 << (n))
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG0_MAINCLK_SHUTOFF    (1 << 0)
#define IMXRT600_SYSCON_SYSCTL0_PDSLEEPCFG0_FBB_PD             (1 << 12)
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0_SYSXTAL_PD           (1 << 13)
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0_SYSPLLLDO_PD         (1 << 17)
#define IMXRT600_SYSCON_SYSCTL0_PDRUNCFG0_SYSPLLANA_PD         (1 << 18)
#define IMXRT600_SYSCON_SYSCTL0_PDWAKECFG_FBBKEEPST            (1 << 1)
#define IMXRT600_SYSCON_SYSCTL0_STARTEN1_PMIC                  (1 << 26)

#define IMXRT600_CACHE_BASE     (IMXRT600_APB_BASE + 0x33000)
#define IMXRT600_CACHE_CCR      ((uint32_t *)(IMXRT600_CACHE_BASE + 0x800))
#define IMXRT600_CACHE_REG0_TOP ((uint32_t *)(IMXRT600_CACHE_BASE + 0x14))
#define IMXRT600_CACHE_REG1_TOP ((uint32_t *)(IMXRT600_CACHE_BASE + 0x18))
#define IMXRT600_CACHE_POLSEL   ((uint32_t *)(IMXRT600_CACHE_BASE + 0x1C))

#define IMXRT600_CACHE_CCR_ENCACHE                   (1 << 0)
#define IMXRT600_CACHE_CCR_ENWRBUF                   (1 << 1)
#define IMXRT600_CACHE_CCR_INVW0                     (1 << 24)
#define IMXRT600_CACHE_CCR_PUSHW0                    (1 << 25)
#define IMXRT600_CACHE_CCR_INVW1                     (1 << 26)
#define IMXRT600_CACHE_CCR_PUSHW1                    (1 << 27)
#define IMXRT600_CACHE_CCR_GO                        (1 << 31)
#define IMXRT600_CACHE_POLSEL_REG0_POLICY_WRITE_BACK (0b10 << 0)
#define IMXRT600_CACHE_POLSEL_REG1_POLICY_WRITE_BACK (0b10 << 2)
#define IMXRT600_CACHE_POLSEL_REG2_POLICY_WRITE_BACK (0b10 << 4)

#define IMXRT600_OSTIMER0_BASE     (IMXRT600_APB_BASE + 0x113000)
#define IMXRT600_OSTIMER0_EVTIMERL ((uint32_t *)(IMXRT600_OSTIMER0_BASE + 0x0))

#define IMXRT600_PMC_BASE      (IMXRT600_APB_BASE + 0x135000)
#define IMXRT600_PMC_STATUS    ((uint32_t *)(IMXRT600_PMC_BASE + 0x004))
#define IMXRT600_PMC_CTRL      ((uint32_t *)(IMXRT600_PMC_BASE + 0x00C))
#define IMXRT600_PMC_RUNCTRL   ((uint32_t *)(IMXRT600_PMC_BASE + 0x010))
#define IMXRT600_PMC_SLEEPCTRL ((uint32_t *)(IMXRT600_PMC_BASE + 0x014))
#define IMXRT600_PMC_AUTOWKUP  ((uint32_t *)(IMXRT600_PMC_BASE + 0x024))

#define IMXRT600_PMC_STATUS_ACTIVEFSM (1 << 0)
#define IMXRT600_PMC_CTRL_APPLYCFG    (1 << 0)
#define IMXRT600_PMC_CTRL_LVDCOREIE   (1 << 20)
#define IMXRT600_PMC_CTRL_LVDCORERE   (1 << 21)
#define IMXRT600_PMC_CTRL_AUTOWKEN    (1 << 28)
#define IMXRT600_PMC_RUNCTRL_1_13V    0b110010
#define IMXRT600_PMC_SLEEPCTRL_0_7V   0b001010

#define IMXRT600_IOCON_BASE         (IMXRT600_APB_BASE + 0x4000)
#define IMXRT600_IOCON_P0(n)        ((uint32_t *)(IMXRT600_IOCON_BASE + ((n) * 4)))
#define IMXRT600_IOCON_P1(n)        ((uint32_t *)(IMXRT600_IOCON_BASE + 0x080 + ((n) * 4)))
#define IMXRT600_IOCON_P2(n)        ((uint32_t *)(IMXRT600_IOCON_BASE + 0x100 + ((n) * 4)))
#define IMXRT600_IOCON_P3(n)        ((uint32_t *)(IMXRT600_IOCON_BASE + 0x180 + ((n) * 4)))
#define IMXRT600_IOCON_FC15_I2C_SCL ((uint32_t *)(IMXRT600_IOCON_BASE + 0x400))
#define IMXRT600_IOCON_FC15_I2C_SDA ((uint32_t *)(IMXRT600_IOCON_BASE + 0x404))

#define IMXRT600_IOCON_P_FUNC(n) (n)
#define IMXRT600_IOCON_P_IBENA    (1 << 6)
#define IMXRT600_IOCON_P_SLEWRATE (1 << 7)
#define IMXRT600_IOCON_P_ODENA    (1 << 10)

#define IMXRT600_CTIMER0_BASE (IMXRT600_APB_BASE + 0x28000)
#define IMXRT600_CTIMER1_BASE (IMXRT600_APB_BASE + 0x29000)
#define IMXRT600_CTIMER2_BASE (IMXRT600_APB_BASE + 0x2A000)
#define IMXRT600_CTIMER3_BASE (IMXRT600_APB_BASE + 0x2B000)
#define IMXRT600_CTIMER4_BASE (IMXRT600_APB_BASE + 0x2C000)

#define IMXRT600_CTIMER_IR(base)  ((uint32_t *)((base) + 0x00))
#define IMXRT600_CTIMER_TCR(base) ((uint32_t *)((base) + 0x04))
#define IMXRT600_CTIMER_TC(base)  ((uint32_t *)((base) + 0x08))
#define IMXRT600_CTIMER_PR(base)  ((uint32_t *)((base) + 0x0C))
#define IMXRT600_CTIMER_MCR(base) ((uint32_t *)((base) + 0x14))
#define IMXRT600_CTIMER_MR0(base) ((uint32_t *)((base) + 0x18))

#define IMXRT600_CTIMER_IR_MR0INT (1 << 0)
#define IMXRT600_CTIMER_TCR_CEN   (1 << 0)
#define IMXRT600_CTIMER_TCR_CRST  (1 << 1)
#define IMXRT600_CTIMER_MCR_MR0I  (1 << 0)
#define IMXRT600_CTIMER_MCR_MR0R  (1 << 1)
#define IMXRT600_CTIMER_MCR_MR0S  (1 << 2)

#define IMXRT600_CTIMER0_IRQn 10
#define IMXRT600_CTIMER1_IRQn 11
#define IMXRT600_CTIMER2_IRQn 39
#define IMXRT600_CTIMER3_IRQn 13
#define IMXRT600_CTIMER4_IRQn 40

#define IMXRT600_FLEXCOMM0_BASE  (IMXRT600_APB_BASE + 0x106000)
#define IMXRT600_FLEXCOMM1_BASE  (IMXRT600_APB_BASE + 0x107000)
#define IMXRT600_FLEXCOMM2_BASE  (IMXRT600_APB_BASE + 0x108000)
#define IMXRT600_FLEXCOMM3_BASE  (IMXRT600_APB_BASE + 0x109000)
#define IMXRT600_FLEXCOMM4_BASE  (IMXRT600_APB_BASE + 0x122000)
#define IMXRT600_FLEXCOMM5_BASE  (IMXRT600_APB_BASE + 0x123000)
#define IMXRT600_FLEXCOMM6_BASE  (IMXRT600_APB_BASE + 0x124000)
#define IMXRT600_FLEXCOMM7_BASE  (IMXRT600_APB_BASE + 0x125000)
#define IMXRT600_FLEXCOMM15_BASE (IMXRT600_APB_BASE + 0x127000)

#define IMXRT600_FLEXCOMM_PSELID(base) ((uint32_t *)((base) + 0xFF8))

#define IMXRT600_FLEXCOMM_PSELID_PERSEL_USART 0x1
#define IMXRT600_FLEXCOMM_PSELID_PERSEL_I2C   0x3

#define IMXRT600_FLEXCOMM0_IRQn 14
#define IMXRT600_FLEXCOMM1_IRQn 15
#define IMXRT600_FLEXCOMM2_IRQn 16
#define IMXRT600_FLEXCOMM3_IRQn 17
#define IMXRT600_FLEXCOMM4_IRQn 18
#define IMXRT600_FLEXCOMM5_IRQn 19
#define IMXRT600_FLEXCOMM6_IRQn 43
#define IMXRT600_FLEXCOMM7_IRQn 44

#define IMXRT600_USART0_BASE (IMXRT600_APB_BASE + 0x106000)
#define IMXRT600_USART1_BASE (IMXRT600_APB_BASE + 0x107000)
#define IMXRT600_USART2_BASE (IMXRT600_APB_BASE + 0x108000)
#define IMXRT600_USART3_BASE (IMXRT600_APB_BASE + 0x109000)
#define IMXRT600_USART4_BASE (IMXRT600_APB_BASE + 0x122000)
#define IMXRT600_USART5_BASE (IMXRT600_APB_BASE + 0x123000)
#define IMXRT600_USART6_BASE (IMXRT600_APB_BASE + 0x124000)
#define IMXRT600_USART7_BASE (IMXRT600_APB_BASE + 0x125000)

#define IMXRT600_USART_CFG(base)          ((uint32_t *)((base) + 0x000))
#define IMXRT600_USART_CRL(base)          ((uint32_t *)((base) + 0x004))
#define IMXRT600_USART_INTENSET(base)     ((uint32_t *)((base) + 0x00C))
#define IMXRT600_USART_BRG(base)          ((uint32_t *)((base) + 0x020))
#define IMXRT600_USART_FIFOCFG(base)      ((uint32_t *)((base) + 0xE00))
#define IMXRT600_USART_FIFOSTAT(base)     ((uint32_t *)((base) + 0xE04))
#define IMXRT600_USART_FIFOTRIG(base)     ((uint32_t *)((base) + 0xE08))
#define IMXRT600_USART_FIFOINTENSET(base) ((uint32_t *)((base) + 0xE10))
#define IMXRT600_USART_FIFOINTENCLR(base) ((uint32_t *)((base) + 0xE14))
#define IMXRT600_USART_FIFOINTSTAT(base)  ((uint32_t *)((base) + 0xE18))
#define IMXRT600_USART_FIFOWR(base)       ((uint32_t *)((base) + 0xE20))
#define IMXRT600_USART_FIFORD(base)       ((uint32_t *)((base) + 0xE30))

#define IMXRT600_USART_CFG_ENABLE          (1 << 0)
#define IMXRT600_USART_CFG_DATALEN_8BIT    (0x1 << 2)
#define IMXRT600_USART_FIFOCFG_ENABLETX    (1 << 0)
#define IMXRT600_USART_FIFOCFG_ENABLERX    (1 << 1)
#define IMXRT600_USART_FIFOSTAT_TXEMPTY    (1 << 4)
#define IMXRT600_USART_FIFOSTAT_TXNOTFULL  (1 << 5)
#define IMXRT600_USART_FIFOSTAT_RXNOTEMPTY (1 << 6)
#define IMXRT600_USART_FIFOTRIG_TXLVLENA   (1 << 0)
#define IMXRT600_USART_FIFOTRIG_RXLVLENA   (1 << 1)
#define IMXRT600_USART_FIFOTRIG_TXLVL(v)   ((v) << 8)
#define IMXRT600_USART_FIFOTRIG_RXLVL(v)   ((v) << 16)
#define IMXRT600_USART_FIFOINTEN_TXLVL     (1 << 2)
#define IMXRT600_USART_FIFOINTEN_RXLVL     (1 << 3)
#define IMXRT600_USART_FIFOINTSTAT_TXLVL   (1 << 2)
#define IMXRT600_USART_FIFOINTSTAT_RXLVL   (1 << 3)

#define IMXRT600_I2C15_BASE (IMXRT600_APB_BASE + 0x127000)

#define IMXRT600_I2C_CFG(base)     ((uint32_t *)((base) + 0x800))
#define IMXRT600_I2C_STAT(base)    ((uint32_t *)((base) + 0x804))
#define IMXRT600_I2C_CLKDIV(base)  ((uint32_t *)((base) + 0x814))
#define IMXRT600_I2C_MSTCTL(base)  ((uint32_t *)((base) + 0x820))
#define IMXRT600_I2C_MSTTIME(base) ((uint32_t *)((base) + 0x824))
#define IMXRT600_I2C_MSTDAT(base)  ((uint32_t *)((base) + 0x828))

#define IMXRT600_I2C_CFG_MSTEN          (1 << 0)
#define IMXRT600_I2C_STAT_MSTPENDING    (1 << 0)
#define IMXRT600_I2C_MSTCTL_MSTCONTINUE (1 << 0)
#define IMXRT600_I2C_MSTCTL_MSTSTART    (1 << 1)
#define IMXRT600_I2C_MSTCTL_MSTSTOP     (1 << 2)

#endif
